// terminal logic

const terminal = {
    "1":{
        title:"Keyboard",
        symptoms:`
                <ol>
                  <li>عدم استجابة بعض الأزرار
                  <li> ضغط على مفتاح يسبب ضغطًا على مفاتيح أخرى
                  <li> ظهور حروف أو أرقام غير صحيحة
                  <li> عدم عمل جميع الأزرار
                  <li> استجابة بطيئة أو تأخير عند الضغط على الأزرار
                  <li> لوحة المفاتيح تعمل ولكن الأضواء لا تعمل
                  <li> إغلاق أو تجميد النظام عند توصيل لوحة المفاتيح
                  <li> ضغط المفاتيح بشكل غير عادي (مفتاح يتكرر تلقائيًا)
                  <li> تشغيل بعض الوظائف الخاصة تلقائيًا
                   </ol>
                  `,
        causes:`
                <ol>
                    <li> مشاكل في الاتصال
                    <li> تعريفات غير محدثة أو مفقودة:  
                    <li> تراكم الأوساخ والغبار:  
                    <li> تلف في الأجزاء الداخلية
                    <li> اعدادات النظام
                    <li> مشكلة في البرمجيات أو النظام
                </ol>
                `,
        solutions:`
                <ol>
                    <li>إعادة تشغيل الجهاز: في بعض الأحيان، قد تؤدي إعادة تشغيل الكمبيوتر إلى حل المشكلة.
                    <li>توصيل لوحة المفاتيح بمنفذ آخر: جرب توصيل لوحة المفاتيح في منفذ USB آخر لمعرفة ما إذا كانت المشكلة تتعلق بالمنفذ نفسه.
                    <li>تنظيف لوحة المفاتيح: نظف لوحة المفاتيح باستخدام هواء مضغوط أو بفرشاة ناعمة لإزالة الغبار والأوساخ.
                    <li>تحديث التعريفات: تأكد من تحديث تعريفات لوحة المفاتيح عبر "إدارة الأجهزة" في الويندوز.
                    <li>التحقق من الإعدادات: تأكد من أن اللغة وتخطيط لوحة المفاتيح في النظام متوافقة مع لوحة المفاتيح الفعلية.
                    <li>تجربة لوحة مفاتيح أخرى: في حالة استمرار المشكلة، جرب لوحة مفاتيح أخرى على نفس الجهاز للتأكد من عدم وجود خلل في الجهاز نفسه.
                </ol>
        `,
    },
    "2":{
        title:"Mouse",
        symptoms:`
        <ol> 
            <li>	عدم استجابة الماوس.
            <li>	الحركة المتقطعة أو البطيئة للماوس.
            <li>	المؤشر يتحرك بشكل عشوائي.
            <li>	الأزرار لا تعمل أو لا تستجيب بشكل صحيح.
            <li>	نقرات غير متوقعة عند تحريك المؤشر.
            <li>	الماوس يعمل بشكل متقطع.
            <li>	تأخير في استجابة الماوس.
            <li>	إضاءة الماوس لا تعمل إذا كان يحتوي على إضاءة LED
        </ol>
        `,
        causes:`
        <ol> 
            <li>	مشكلة في الاتصال: الكابل التالف أو المنفذ المعيب قد يؤثر على الاتصال بين الماوس والجهاز.
            <li>	مشكلة في البطاريات (للماوس اللاسلكي): نفاد البطاريات أو تداخل الإشارة قد يؤدي إلى تعطل الماوس.
            <li>	تراكم الأوساخ أو الغبار: تراكم الأوساخ في المستشعر أو الأزرار قد يتسبب في عدم استجابة الماوس.
            <li>	التعريفات القديمة أو المفقودة: قد تكون التعريفات غير مثبتة أو قديمة، مما يسبب مشاكل في الاستجابة.
            <li>	المشاكل البرمجية: قد تكون هناك مشاكل في إعدادات النظام أو البرامج التي تتداخل مع الماوس.
            <li>	خلل في المكونات الداخلية: مثل تلف الأزرار أو المستشعر داخل الماوس.
        </ol>
        `,
        solutions:`
        <ol>
            <li>	إعادة تشغيل الجهاز: يمكن أن تساعد إعادة التشغيل في حل المشاكل البسيطة.
            <li>	تحقق من الاتصال: جرب توصيل الماوس بمنفذ USB آخر أو استخدام منفذ مختلف إذا كان الماوس سلكيًا.
            <li>	تنظيف الماوس: استخدم هواء مضغوط أو فرشاة ناعمة لتنظيف المستشعر والأزرار.
            <li>	تحديث التعريفات: تحقق من تحديث تعريفات الماوس من خلال "إدارة الأجهزة" في الويندوز.
            <li>	تجربة الماوس على جهاز آخر: قم بتوصيل الماوس بجهاز آخر للتأكد من أن المشكلة ليست في جهاز الكمبيوتر.
            <li>	استبدال البطاريات (للماوس اللاسلكي): إذا كان الماوس لاسلكيًا، قم بتغيير البطاريات أو إعادة توصيل جهاز الاستقبال.
            <li>	إعادة ضبط إعدادات النظام: تأكد من أن إعدادات الماوس في النظام صحيحة وأنه لا توجد إعدادات متضاربة.
        </ol>
        `,
    },
    "3":{
        title:"الطابعة",
        symptoms:`
        <ol>
            <li>	الطابعة لا تطبع: عند محاولة الطباعة، لا يحدث أي شيء.
            <li>	ظهور رسائل خطأ على الكمبيوتر: مثل "الطابعة غير متصلة" أو "نفاد الحبر".
            <li>	الطباعة بطيئة جدًا: تأخير في استجابة الطابعة للطباعة.
            <li>	الطباعة تحتوي على مسافات فارغة: قد تلاحظ أن الصفحات تُطبع ولكن هناك أجزاء مفقودة.
            <li>	الطابعة تطبع بشكل غير واضح أو باهت: النصوص أو الصور المطبوعة غير واضحة أو ضبابية.
            <li>	الطابعة تصدر ضوضاء غريبة: أصوات غير طبيعية عند الطباعة.
            <li>	الطابعة تتعطل أو تتوقف عن العمل فجأة: أثناء الطباعة، تتوقف الطابعة عن العمل فجأة
        </ol>
        `,
        causes:`
        <ol>
            <li>	مشكلة في الاتصال: قد تكون الطابعة غير موصلة بشكل صحيح بالكمبيوتر أو الشبكة (في حالة الطابعات اللاسلكية).
            <li>	الطابعة في وضع "إيقاف مؤقت" أو "انتظار": قد يكون قد تم وضع الطابعة في حالة توقف مؤقت بسبب خطأ.
            <li>	نفاد الحبر أو مسحوق الطباعة: يمكن أن يكون الحبر أو مسحوق الطابعة نفد.
            <li>	مشكلة في تعريفات الطابعة: قد تكون تعريفات الطابعة قديمة أو غير مثبتة بشكل صحيح.
            <li>	وجود ورق عالق: قد يكون هناك ورق عالق داخل الطابعة، مما يمنعها من الطباعة بشكل صحيح.
            <li>	مشاكل في إعدادات الطابعة أو النظام: قد تكون إعدادات الطابعة غير صحيحة أو تحتاج إلى تعديل.
            <li>	تلف في رأس الطباعة: في حالة الطابعات النفثية، قد يكون رأس الطباعة مسدودًا أو تالفًا.
            <li>	إعدادات الشبكة: في حالة الطابعات الشبكية، قد تكون هناك مشكلة في الاتصال بالشبكة.
        </ol>
        `,
        solutions:`
            <ol>
               <li>	تحقق من الاتصال: تأكد من أن الطابعة متصلة بشكل صحيح بالكمبيوتر أو الشبكة (سلكيًا أو لاسلكيًا).
               <li>	إلغاء وضع الانتظار: تأكد من أن الطابعة ليست في وضع "إيقاف مؤقت" أو "انتظار" في إعدادات الطابعة.
               <li>	استبدال الحبر أو مسحوق الطباعة: تأكد من أن الحبر أو مسحوق الطابعة غير منتهي، وإذا كان، قم باستبداله.
               <li>	تحديث تعريفات الطابعة: تحقق من أنك تستخدم أحدث تعريفات للطابعة عبر "إدارة الأجهزة" أو من موقع الشركة المصنعة.
               <li>	إزالة الورق العالق: قم بفتح الطابعة بعناية وأزل أي ورق عالق داخل الطابعة.
               <li>	إعادة ضبط إعدادات الطابعة: تحقق من إعدادات الطابعة على الكمبيوتر وتأكد من أنها متوافقة مع نوع الطباعة الذي ترغب في القيام به.
               <li>	تنظيف رأس الطباعة: إذا كانت الطابعة نفثية، قم بتنظيف رأس الطباعة باستخدام الأداة المدمجة في الطابعة أو اتباع التعليمات الخاصة.
               <li>	إعادة توصيل الشبكة: إذا كانت الطابعة متصلة بالشبكة، تأكد من أنها متصلة بالشبكة بشكل صحيح، وأعد ضبط الاتصال إذا لزم الأمر.
               <li>	إعادة تشغيل الطابعة والكمبيوتر: في بعض الأحيان، يمكن أن يؤدي إعادة تشغيل الطابعة والكمبيوتر إلى حل المشكلات البسيطة.
            </ol>
        `,
    },
    "4":{
        title:"الشاشة",
        symptoms:`
        <ol>
            <li>	الشاشة لا تعرض أي شيء: الشاشة سوداء أو لا تظهر أي صورة.
            <li>	الشاشة مشوشة أو بها خطوط ملونة: تظهر خطوط أو تشويش على الشاشة.
            <li>	وجود اهتزاز أو تموج في الصورة: الشاشة تهتز أو يوجد تأثير تموج في الصورة.
            <li>	الشاشة تظهر بشكل غير واضح أو باهت: الصورة غير واضحة أو شديدة الإضاءة أو مظلمة جدًا.
            <li>	الشاشة تومض أو تعطي فلاشات: تظهر فلاشات أو تومض بشكل مفاجئ أثناء الاستخدام.
            <li>	الشاشة بها بقع مضيئة أو ميتة: تظهر بقع مشرقة أو نقاط ميتة على الشاشة لا تستجيب.
            <li>	الشاشة لا تستجيب للمؤشر: لا يتمكن المؤشر من التحرك بشكل طبيعي على الشاشة.
            <li>	ظهور "الشاشة الزرقاء" أو رموز خطأ: تظهر رسالة خطأ أو شاشة زرقاء على الشاشة.
        </ol>
        `,
        causes:`
        <ol>
            <li>	مشكلة في الاتصال: قد تكون الكابلات أو التوصيلات (HDMI، VGA) تالفة أو غير موصلة بشكل صحيح.
            <li>	إعدادات غير صحيحة للدقة أو التحديثات: قد تكون دقة الشاشة أو إعدادات التحديث غير متوافقة مع الجهاز أو بطاقة الرسومات.
            <li>	مشكلة في بطاقة الرسومات: قد يكون هناك خلل في بطاقة الرسومات أو معالج الرسومات (GPU).
            <li>	إعدادات الطاقة: قد تكون مشكلة في إعدادات الطاقة أو وضع السكون في النظام.
            <li>	مشكلة في مصدر الطاقة: قد يكون هناك خلل في مزود الطاقة للشاشة أو في الكابل الموصل.
            <li>	تلف في لوحة الشاشة (الشاشة نفسها): قد يكون هناك عطل مادي في الشاشة نفسها.
            <li>	تسريب الحبر في شاشات LCD/LED: قد يحدث تلف في أجزاء من الشاشة بسبب التسريب أو تلف المكونات.
            <li>	ارتفاع درجة الحرارة: قد تؤدي الحرارة الزائدة إلى مشاكل في العرض أو إيقاف الشاشة.
        </ol>
        `,
        solutions:`
        <ol>
            <li>	تحقق من الاتصال: تأكد من أن الكابلات موصولة بشكل صحيح بين الكمبيوتر والشاشة. جرب استخدام كابل آخر أو منفذ مختلف.
            <li>	تعديل إعدادات الدقة والتحديث: تحقق من إعدادات دقة الشاشة وتأكد من أنها متوافقة مع بطاقة الرسومات. يمكنك ضبط هذه الإعدادات من خلال لوحة التحكم أو إعدادات النظام.
            <li>	اختبار بطاقة الرسومات: جرب توصيل الشاشة بجهاز آخر للتأكد من أن المشكلة ليست في بطاقة الرسومات. إذا استمرت المشكلة، قد تحتاج إلى تحديث أو استبدال بطاقة الرسومات.
            <li>	إعادة ضبط الشاشة: جرب إعادة ضبط إعدادات الشاشة إلى الإعدادات الافتراضية من خلال القائمة المنبثقة أو إعدادات الشاشة.
            <li>	التحقق من مزود الطاقة: تأكد من أن مزود الطاقة للشاشة يعمل بشكل صحيح. جرب توصيل الشاشة بمصدر طاقة آخر أو استخدام كابل مختلف.
            <li>	فحص الشاشة بحثًا عن التلف: تحقق إذا كان هناك أي تلف مادي في الشاشة (مثل الحواف المتصدعة أو بقع ميتة). في حالة التلف الشديد، قد تحتاج إلى استبدال الشاشة.
            <li>	التهوية وتبريد الشاشة: تأكد من أن الشاشة لا تتعرض لدرجة حرارة عالية جدًا. جرب نقل الشاشة إلى مكان بارد أو توفير تهوية أفضل.
            <li>	إعادة تشغيل الكمبيوتر: في بعض الحالات، قد تؤدي إعادة تشغيل الكمبيوتر إلى حل مشكلات العرض المؤقتة.
        </ol> 
        `,
    },
    "5":{
        title:"الكاميرا",
        symptoms:`
        <ol>
           <li>	الكاميرا لا تعمل أو لا تعرض صورة: عند محاولة استخدام الكاميرا، لا تظهر أي صورة على الشاشة أو في التطبيق.
           <li>	صورة ضبابية أو غير واضحة: الصورة غير واضحة أو مشوشة، أو تظهر غير حادة.
           <li>	الكاميرا تتعطل فجأة أثناء العمل: الكاميرا تعمل لبعض الوقت ثم تتوقف فجأة عن العمل.
           <li>	الكاميرا تعرض شاشة سوداء: الشاشة تظهر باللون الأسود أثناء محاولة تشغيل الكاميرا.
           <li>	الكاميرا تعرض ألوان غير طبيعية: تظهر الألوان بشكل غير صحيح (أحمر، أخضر، أو أزرق) أو غير متوازنة.
           <li>	الكاميرا لا تستجيب للأوامر: لا يمكن التبديل بين وضعيات الكاميرا أو لا تستجيب للأوامر من التطبيقات.
           <li>	الصورة تظهر مشوشة أو بها خطوط: عند تصوير فيديو أو صورة ثابتة، تظهر صورة مشوشة أو بها خطوط غير طبيعية.
           <li>	تأخير في الصورة أو الفيديو: هناك تأخير ملحوظ بين الضغط على زر التصوير وعرض الصورة أو الفيديو.<li>
        </ol>
        `,
        causes:`
        <ol>
            <li>	مشكلة في التعريفات أو البرنامج: قد تكون التعريفات غير محدثة أو مفقودة.
            <li>	مشكلة في الاتصال أو الجهاز: الكاميرا قد تكون غير موصلة بشكل صحيح بالجهاز (إذا كانت كاميرا خارجية).
            <li>	التطبيقات أو البرامج الأخرى تتعارض مع الكاميرا: قد تتسبب بعض التطبيقات أو البرامج في تعطيل الكاميرا.
            <li>	مشاكل في إعدادات الكاميرا: قد تكون إعدادات الكاميرا غير صحيحة، مثل إعدادات التباين أو السطوع.
            <li>	مشكلة في العدسة أو المستشعر: تلف في العدسة أو المستشعر قد يسبب صورة ضبابية أو مشوشة.
            <li>	مشكلة في الكابل أو الاتصال (للكاميرات الخارجية): تلف في الكابل الموصل أو مشكلة في المنفذ قد يتسبب في عدم عمل الكاميرا.
            <li>	الحرارة الزائدة: ارتفاع درجة حرارة الكاميرا أو الجهاز قد يتسبب في تعطيل الكاميرا.
            <li>	البرنامج لا يتوافق مع الكاميرا: بعض التطبيقات قد لا تتوافق مع طراز الكاميرا الخاص بك.
            <li>	التلف الداخلي في الكاميرا: وجود تلف مادي في الكاميرا مثل كسر في العدسة أو خلل في المستشعر
        </ol>
        `,
        solutions:`
        <ol>
            <li>	تحديث التعريفات: تأكد من أن التعريفات الخاصة بالكاميرا محدثة، سواء عبر "إدارة الأجهزة" أو موقع الشركة المصنعة.
            <li>	إعادة تشغيل الجهاز: أعد تشغيل الجهاز أو التطبيق الذي تستخدمه لتشغيل الكاميرا، فقد يساعد ذلك في حل المشكلات المؤقتة.
            <li>	تحقق من الاتصال (للكاميرات الخارجية): تأكد من أن الكاميرا موصلة بشكل صحيح، جرب استخدام منفذ USB آخر أو كابل مختلف.
            <li>	إغلاق التطبيقات المتضاربة: تأكد من عدم تشغيل برامج أخرى تستخدم الكاميرا في نفس الوقت مثل برامج الفيديو أو الاجتماعات.
            <li>	إعادة ضبط إعدادات الكاميرا: قم بإعادة ضبط إعدادات الكاميرا إلى الإعدادات الافتراضية في التطبيق أو في إعدادات النظام.
            <li>	تنظيف العدسة: نظف عدسة الكاميرا بلطف باستخدام قطعة قماش ناعمة لإزالة أي غبار أو بصمات.
            <li>	تحديث أو تغيير التطبيقات: إذا كانت الكاميرا لا تعمل مع تطبيق معين، حاول تحديث التطبيق أو استخدام تطبيق آخر.
            <li>	تقليل درجة حرارة الجهاز: تأكد من أن الجهاز ليس ساخنًا جدًا. حاول تبريده أو تشغيل الكاميرا في مكان بارد.
            <li>	استبدال الكاميرا أو فحصها: إذا كانت المشكلة تتعلق بتلف مادي في الكاميرا، قد تحتاج إلى استبدالها أو إصلاحها.<li>
        </ol>
        `,
    },
    "6":{
        title:"سماعات الرأس أو مكبرات الصوت",
        symptoms:`
        <ol>
            <li>	عدم وجود صوت: لا يصدر أي صوت من السماعات أو مكبر الصوت.
            <li>	الصوت منخفض أو ضعيف جدًا: الصوت يسمع بشكل خافت جدًا أو غير واضح.
            <li>	تشويش أو تداخل في الصوت: الصوت يتضمن تشويشًا أو ضوضاء غير طبيعية.
            <li>	الصوت يتقطع أو يتوقف فجأة: قد يتوقف الصوت أو يتقطع أثناء التشغيل.
            <li>	الصوت من جانب واحد فقط: سماعة واحدة فقط تصدر الصوت، بينما الأخرى لا تعمل.
            <li>	الصوت غير متوازن أو مشوه: يكون الصوت غير طبيعي أو يحتوي على تشوهات.
            <li>	إضاءة السماعات لا تعمل (إذا كانت تحتوي على إضاءة): إذا كانت السماعات تحتوي على إضاءة LED، قد لا تعمل الإضاءة.
            <li>	السماعات أو المكبرات تصدر أصوات غير طبيعية (مثل الطقطقة): إصدار أصوات غير طبيعية عند التوصيل أو أثناء الاستماع.
        </ol>
        `,
        causes:`
        <ol>
           <li>	مشكلة في الاتصال أو الكابل: قد يكون الكابل الموصل بالسماعات أو المكبرات تالفًا أو غير موصول بشكل صحيح.
           <li>	مشاكل في الإعدادات الصوتية: قد تكون إعدادات الصوت على الكمبيوتر أو الجهاز غير صحيحة (مثل حجم الصوت منخفض جدًا أو موازن الصوت غير متوازن).
           <li>	مشكلة في مصدر الطاقة (للأجهزة التي تحتاج طاقة): قد يكون هناك مشكلة في مزود الطاقة إذا كانت السماعات أو المكبرات تعمل بالكهرباء.
           <li>	تلف في السماعات أو المكبرات: تلف داخلي في المكونات (مثل مكبر الصوت أو السائق) قد يؤدي إلى مشكلات في الصوت.
           <li>	تعريفات غير محدثة: قد تكون تعريفات الصوت في الجهاز قديمة أو غير محدثة بشكل صحيح.
           <li>	مشكلة في جهاز التشغيل أو التطبيق: قد يكون هناك مشكلة في البرنامج أو التطبيق الذي تستخدمه لتشغيل الصوت.
           <li>	تداخل مع أجهزة أخرى: قد يكون هناك تداخل في الإشارة إذا كانت السماعات أو المكبرات لاسلكية.
           <li>	مشاكل في بطاقة الصوت: قد تكون بطاقة الصوت في الجهاز بها خلل أو تحتاج إلى تحديث
        </ol>
        `,
        solutions:`
        <ol>
            <li>	تحقق من الاتصال والكابل: تأكد من أن الكابلات موصلة بشكل صحيح وغير تالفة. جرب استخدام كابل مختلف إذا لزم الأمر.
            <li>	ضبط إعدادات الصوت: تأكد من أن الصوت في إعدادات الجهاز مضبوط بشكل صحيح وأنه ليس منخفضًا جدًا أو مكتومًا. تحقق من إعدادات الموازن (Equalizer).
            <li>	التحقق من مصدر الطاقة: إذا كانت السماعات أو مكبرات الصوت تعمل بالكهرباء، تأكد من أنها موصلة بشكل جيد إلى مصدر الطاقة. تحقق من وجود بطاريات أو أن الجهاز متصل بالكهرباء بشكل صحيح.
            <li>	فحص السماعات أو المكبرات: جرب توصيل السماعات بجهاز آخر لمعرفة ما إذا كانت المشكلة من السماعات أو الجهاز المستخدم. إذا كانت المشكلة في السماعات نفسها، قد تحتاج إلى إصلاح أو استبدال المكونات التالفة.
            <li>	تحديث تعريفات الصوت: تحقق من أن تعريفات الصوت على جهاز الكمبيوتر أو الهاتف محدثة، وقم بتحديثها إذا لزم الأمر من خلال "إدارة الأجهزة" أو من موقع الشركة المصنعة.
            <li>	إعادة تشغيل الجهاز: أعد تشغيل الجهاز أو التطبيق الذي تستخدمه في حال كانت المشكلة تتعلق بتعليق النظام أو التطبيق.
            <li>	التخلص من التداخل اللاسلكي: إذا كانت السماعات أو المكبرات لاسلكية، حاول إعادة توصيلها أو استخدام جهاز آخر لتقليل التداخل مع الأجهزة الأخرى.
            <li>	اختبار بطاقة الصوت: جرب توصيل سماعات الرأس بجهاز آخر للتأكد من أن المشكلة ليست في بطاقة الصوت الخاصة بالجهاز. إذا استمرت المشكلة، قد تحتاج إلى تحديث أو استبدال بطاقة الصوت.
        </ol>
        `,
    },
    "7":{
        title:"الميكرفون ",
        symptoms:`
        <ol>
            <li>	الميكروفون لا يعمل: لا يتم التقاط الصوت أو لا يحدث أي استجابة عند التحدث.
            <li>	الصوت منخفض جدًا: الصوت يكون ضعيفًا جدًا أو غير مسموع.
            <li>	صوت مشوش أو به تشويش: الصوت يحتوي على ضوضاء أو تشويش غير طبيعي.
            <li>	صوت متقطع أو يتوقف فجأة: الصوت يتوقف أو يتقطع أثناء الحديث.
            <li>	الميكروفون يعيد الصوت أو يصدر صدى: يتم إعادة الصوت الذي قيل أو هناك صدى غير مرغوب فيه.
            <li>	الميكروفون يلتقط ضوضاء الخلفية فقط: الميكروفون يلتقط الأصوات المحيطة فقط ولا يلتقط الصوت البشري بوضوح.
            <li>	الميكروفون غير متوافق مع التطبيقات: الميكروفون لا يعمل مع بعض التطبيقات أو البرامج.
            <li>	الميكروفون يظهر كـ "غير موجود" أو "غير مفعل": لا يظهر الميكروفون في إعدادات الصوت أو يتم التعرف عليه كجهاز غير مفعل.
        </ol>
        `,
        causes:`
        <ol>
            <li>	مشكلة في الاتصال أو الكابل: إذا كانت السماعات أو الميكروفون سلكيًا، فقد يكون الكابل موصولًا بشكل غير صحيح أو تالفًا.
            <li>	إعدادات غير صحيحة: قد تكون إعدادات الصوت أو الميكروفون في النظام أو التطبيق غير صحيحة.
            <li>	تعريفات غير محدثة: قد تكون تعريفات الميكروفون غير مثبتة أو قديمة، مما يؤدي إلى عدم عمله بشكل صحيح.
            <li>	المشكلة في المنفذ أو الجهاز: قد يكون المنفذ الذي يتم توصيل الميكروفون فيه معطلاً أو يحتوي على مشكلة.
            <li>	المشاكل البرمجية: تعارض البرامج أو تطبيقات أخرى قد تؤثر على أداء الميكروفون.
            <li>	وجود خلل في الميكروفون نفسه: الميكروفون قد يكون معطلاً بسبب خلل داخلي في الأجزاء الميكانيكية أو الإلكترونية.
            <li>	زيادة حساسية الميكروفون: إذا كانت حساسية الميكروفون مرتفعة جدًا، قد يؤدي ذلك إلى التقاط الكثير من الضوضاء.
            <li>	الضوضاء المحيطة: وجود ضوضاء خلفية قوية يمكن أن يجعل الميكروفون يلتقط الأصوات غير المرغوب فيها.
        <ol>
        `,
        solutions:`
        <ol>
            <li>	تحقق من الاتصال والكابل: تأكد من أن الكابل موصل بشكل صحيح بالجهاز أو المنفذ. جرب استخدام كابل آخر أو منفذ مختلف إذا كان الميكروفون سلكيًا.
            <li>	ضبط إعدادات الميكروفون: قم بضبط إعدادات الميكروفون في "إعدادات الصوت" في جهاز الكمبيوتر أو الهاتف. تأكد من أنه مختار كجهاز الإدخال الافتراضي.
            <li>	تحديث أو تثبيت التعريفات: تأكد من أن تعريفات الميكروفون محدثة أو مثبتة بشكل صحيح عبر "إدارة الأجهزة" أو من موقع الشركة المصنعة.
            <li>	تجربة الميكروفون على جهاز آخر: جرب توصيل الميكروفون بجهاز آخر للتأكد من أن المشكلة ليست في الجهاز أو المنفذ.
            <li>	تقليل الحساسية أو تحسين الإعدادات: ضبط حساسية الميكروفون من خلال إعدادات الصوت في جهاز الكمبيوتر أو الهاتف لتقليل التقاط الضوضاء.
            <li>	إيقاف البرامج التي قد تتداخل مع الميكروفون: قم بإغلاق أي تطبيقات قد تتسبب في تعارض مع الميكروفون، مثل برامج الاتصال أو الألعاب.
            <li>	تنظيف الميكروفون: في حالة وجود ميكروفون خارجي، قم بتنظيفه برفق باستخدام الهواء المضغوط أو فرشاة ناعمة لإزالة أي غبار أو أوساخ قد تؤثر على أدائه.
            <li>	استخدام الميكروفون مع برنامج آخر: إذا كنت تواجه مشكلة في استخدام الميكروفون مع تطبيق معين، جربه مع تطبيق آخر للتحقق من وجود المشكلة في التطبيق نفسه.
            <li>	استبدال الميكروفون: إذا كانت المشكلة تتعلق بتلف الميكروفون، قد تحتاج إلى استبداله أو إصلاحه في حال كان غير قابل للإصلاح.
        </ol>
        `,
    },
}
// variables
let issue = document.getElementById("issue");
let solve = document.getElementById("solve");
// functions
function getIssue(){
    let issueNum = issue.value;
    if (issueNum == 0){
        solve.innerHTML = `
            <h1>اختر احدى الطرفيات من القائمة المنسدلة</h1>
            <img src="../images/terminal/terminal.gif" alt="terminal" width="750px" height="440px">
        `;
    }
    solve.innerHTML = `
            <h1> ${terminal[issueNum].title}</h1>
            <h2>الاعراض</h2>
            <div id="symptoms">
                 ${terminal[issueNum].symptoms}
                <img src="../images/terminal/${issueNum}.png" alt="issue" width="450px" height="240px">
            </div>
            <br> <hr> 
            <h2>الاسباب</h2> 
            ${terminal[issueNum].causes}
           <br> <hr> 
            <h2> الحلول المقترحة لذلك المشكلة  </h2>
            ${terminal[issueNum].solutions}
            <br>
    `;
}
issue.addEventListener("change",getIssue);